Revit 2027 API
BuiltInFailures.BendFailures.NotBentImage Property
 While making curved beam type "[Type Name]" Image elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentImage { get; }
Public Shared ReadOnly Property NotBentImage As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentImage {
	FailureDefinitionId^ get ();
}
static member NotBentImage : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace